myos.html
---
title: "My Operating System"
date:
layout: post
categories:
tags:
- myos
published: true
comments:
---

<div id="outline-container-org71f901e" class="outline-2">
<h2 id="org71f901e">Definitions</h2>
<div class="outline-text-2" id="text-org71f901e">
</div>
<div id="outline-container-orgc98ade5" class="outline-3">
<h3 id="definition-work"><a id="orgc98ade5"></a>work</h3>
<div class="outline-text-3" id="text-definition-work">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / definition work
Work is expending energy.
</pre>
</div>
</div>
</div>
<div id="outline-container-org7195df3" class="outline-3">
<h3 id="definition-task"><a id="org7195df3"></a>task</h3>
<div class="outline-text-3" id="text-definition-task">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / definition task
A task is a request for work to create a result for a purpose.
</pre>
</div>
</div>
</div>
<div id="outline-container-org79cb9b3" class="outline-3">
<h3 id="definition-machine"><a id="org79cb9b3"></a>machine</h3>
<div class="outline-text-3" id="text-definition-machine">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / definition machine
A machine is a tool capable of doing work to produce a result.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca4b356" class="outline-3">
<h3 id="definition-system"><a id="orgca4b356"></a>system</h3>
<div class="outline-text-3" id="text-definition-system">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / definition system
A system is a collection of tools configured to complete a category of tasks.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc81dd18" class="outline-2">
<h2 id="orgc81dd18">Theorems</h2>
<div class="outline-text-2" id="text-orgc81dd18">
</div>
<div id="outline-container-org1b393b9" class="outline-3">
<h3 id="theorem-1"><a id="org1b393b9"></a>one</h3>
<div class="outline-text-3" id="text-theorem-1">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / theorem 1
An email account provides an interface for the outside world for you to send and receive tasks and work.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac268ad" class="outline-3">
<h3 id="theorem-2"><a id="orgac268ad"></a>two</h3>
<div class="outline-text-3" id="text-theorem-2">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / theorem 2
To maximise efficiency towards reaching your goals:
  - only work for a task
  - only accept tasks with purpose that you accept as a human
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb971b6" class="outline-3">
<h3 id="theorem-3"><a id="orgcb971b6"></a>three</h3>
<div class="outline-text-3" id="text-theorem-3">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / theorem 3
Your energy resource can be extended to superhuman by delegating to other humans or machines.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6eb98af" class="outline-2">
<h2 id="org6eb98af">Policies</h2>
<div class="outline-text-2" id="text-org6eb98af">
</div>
<div id="outline-container-orge5b387d" class="outline-3">
<h3 id="policy-1"><a id="orge5b387d"></a>one</h3>
<div class="outline-text-3" id="text-policy-1">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / policy 1
For each character of the human Aqeel Akber there is:
  - an email account associated on PGP Identity 0x14FC5B7CFED383A3
  - a qube on digital::device::laptop::distro
</pre>
</div>

<p>
<b>Please don't trust the above statement of my PGP Identity blindly</b>. Better,
 cross-check it with the <a href="https://github.com/admiralakber/admiralakber.github.io/blob/master/myos.org">signed PGP commit and original org file used to
 generate this page.</a>
</p>
</div>
</div>
<div id="outline-container-org8170676" class="outline-3">
<h3 id="policy-2"><a id="org8170676"></a>two</h3>
<div class="outline-text-3" id="text-policy-2">
<div class="org-src-container">
<pre class="src src-keypoint">myOS / policy 2
A machine is created as the result of a task. The purpose of the task is create a machine capable of completing another task.
</pre>
</div>
</div>
</div>
</div>
